ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/RESOLVER_RESOLVER_REGS_502CB000h.xml
<module name="RESOLVER_REGS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="RESOLVER_REGS_REVID" acronym="RESOLVER_REGS_REVID" offset="0" width="32" description="The Module and Version Register identifies the module identifier and revision of the RTL module.">
		<bitfield id="REG_MODULE_ID" width="16" begin="31" end="16" resetval="0x26831" description="Resolver module ID" range="31:16" rwaccess="R"/>
	<bitfield id="REG_RTL_VERSION" width="5" begin="15" end="11" resetval="0x0" description="RTL Version." range="15:11" rwaccess="R"/>
	<bitfield id="REG_MAJOR_REVISION" width="3" begin="10" end="8" resetval="0x1" description="Major Revision." range="10:8" rwaccess="R"/>
	<bitfield id="REG_CUSTOM_REVISION" width="2" begin="7" end="6" resetval="0x0" description="Custom Revision." range="7:6" rwaccess="R"/>
	<bitfield id="REG_MINOR_REVISION" width="6" begin="5" end="0" resetval="0x0" description="Minor Revision." range="5:0" rwaccess="R"/>
	</register><register id="RESOLVER_REGS_GLOBAL_CFG" acronym="RESOLVER_REGS_GLOBAL_CFG" offset="4" width="32" description="Global Configuration.">
		<bitfield id="SOC_WIDTH" width="8" begin="31" end="24" resetval="0x0" description="Extension of Start Of Conversion(SOC) pulse width. Width = 40ns + 20ns*soc_width " range="31:24" rwaccess="R/W"/>
	<bitfield id="BURST_CNT" width="8" begin="23" end="16" resetval="0x1" description="This defines the number of burst per sample, 1 is no burst, 2 is 2 samples which will get avg ect.., only valid values are 1,2,4,8,16, and 32" range="23:16" rwaccess="R/W"/>
	<bitfield id="SINGLE_EN" width="1" begin="12" end="12" resetval="0x1" description="1 single adc mode 0 diff adc mode " range="12" rwaccess="R/W"/>
	<bitfield id="MODE" width="4" begin="11" end="8" resetval="0x0" description="This defines the mode of the resolver , the user has 6 options to configure " range="11:8" rwaccess="R/W"/>
	<bitfield id="MASTER_EN" width="1" begin="0" end="0" resetval="0x0" description="Master Enable must leave disabled when cfg is updated0:Disabled1:Enabled When 0 it reset all counters, SM, SEQ, ect.." range="0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_EXCIT_SAMPLE_CFG1" acronym="RESOLVER_REGS_EXCIT_SAMPLE_CFG1" offset="8" width="32" description="Excitation and Sample Configuration1.">
		<bitfield id="EXC_FREQ_PHASE_CFG" width="13" begin="28" end="16" resetval="0x0" description="Defines when to start the8000counter to the SIN LUT, this is one time per master_en 0 -> 1" range="28:16" rwaccess="R/W"/>
	<bitfield id="ADC_SAMPLE_RATE" width="8" begin="15" end="8" resetval="0x8" description="ADC Over Sample Rate (&#60;value> * 2)  0 = Reserved 1 = OSR2 .. 16 = OSR32 > 16 = Reserved" range="15:8" rwaccess="R/W"/>
	<bitfield id="EXC_FREQ_SEL" width="8" begin="7" end="0" resetval="0x200" description="Exciter Frequency select (&#60;freq *10> * 10), only 200-20k, 100-10k, and 50-5k is valid" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_EXCIT_SAMPLE_CFG2" acronym="RESOLVER_REGS_EXCIT_SAMPLE_CFG2" offset="12" width="32" description="Excitation and Sample Configuration2.">
		<bitfield id="PWM_SYNC_IN_EVENT" width="1" begin="31" end="31" resetval="0x0" description="This tells SW we had a pwm_sync_in event after master_en is set, w1tc but new start you must de-assert mater_en to re-arm" range="31" rwaccess="R/W1TC"/>
	<bitfield id="PWM_SYNC_IN_EN" width="1" begin="29" end="29" resetval="0x0" description="0 disable 1 enable the pwm_sync_in dep to start soc is " range="29" rwaccess="R/W"/>
	<bitfield id="PWM_TO_SOC_DLY_START" width="13" begin="28" end="16" resetval="0x400" description="This delay start of SEQ SOC in steps of 800KHz, this is a one time event per master_en 0 -> 1, first power up needs to be 500uS , so reset state of 400 will hit this" range="28:16" rwaccess="R/W"/>
	<bitfield id="PWM_PHASE_INFO" width="13" begin="12" end="0" resetval="0x0" description="This is the latched value of the last pwm_sync_in risge event" range="12:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_EXCIT_SAMPLE_CFG3" acronym="RESOLVER_REGS_EXCIT_SAMPLE_CFG3" offset="16" width="32" description="Excitation and Sample Configuration2.">
		<bitfield id="EXC_AMP_CTRL" width="8" begin="7" end="0" resetval="0x239" description="Defines the amplitude scale, 249 is 100%, > 250 is res" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_IRQSTATUS_RAW_SYS" acronym="RESOLVER_REGS_IRQSTATUS_RAW_SYS" offset="20" width="32" description="Interrupt Raw Status Register For Resolver.">
		<bitfield id="SEQ_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw status of error interrupt for seq_cmp_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RESOLVER_REGS_IRQSTATUS_SYS" acronym="RESOLVER_REGS_IRQSTATUS_SYS" offset="24" width="32" description="Interrupt Status Register For Resolver.">
		<bitfield id="SEQ_ERR" width="1" begin="0" end="0" resetval="0x0" description="Enabled status of  error interrupt for seq_cmp_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="RESOLVER_REGS_IRQENABLE_SET_SYS" acronym="RESOLVER_REGS_IRQENABLE_SET_SYS" offset="28" width="32" description="Interrupt Enable Set Register For Resolver.">
		<bitfield id="SEQ_ERR" width="1" begin="0" end="0" resetval="0x0" description="Enable set for seq_cmp_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RESOLVER_REGS_IRQENABLE_CLR_SYS" acronym="RESOLVER_REGS_IRQENABLE_CLR_SYS" offset="32" width="32" description="Interrupt Enable Clear Register For Resolver.">
		<bitfield id="SEQ_ERR" width="1" begin="0" end="0" resetval="0x0" description="Enable clr for seq_cmp_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RESOLVER_REGS_CAL_CFG" acronym="RESOLVER_REGS_CAL_CFG" offset="36" width="32" description="CAL Config.">
		<bitfield id="CAL_DONE" width="1" begin="8" end="8" resetval="0x0" description="This tells SW CAL data is updated, it will not do a new CAL sample until this is cleared" range="8" rwaccess="R/W1TC"/>
	<bitfield id="CAL_CHSEL" width="4" begin="7" end="4" resetval="0x0" description="This defines the ADC channel for ADC0 and ADC1  For 263P bit 4 is reserved To determine correct value per SOC refer to the ADC Spec for that SOC" range="7:4" rwaccess="R/W"/>
	<bitfield id="CAL_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CAL, each wrt of one will start cal, can not start new one until the other is done and done is cleared , to start a new cal just wrt a new one to this mmr " range="0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_CAL_OBS" acronym="RESOLVER_REGS_CAL_OBS" offset="40" width="32" description="CAL ADC0 and ADC1 Data.">
		<bitfield id="CAL_ADC1_DATA" width="16" begin="31" end="16" resetval="0x0" description="Signed ADC1 Data from CAL channel sample if mode enables ie not mode 1 and mode 2" range="31:16" rwaccess="RO"/>
	<bitfield id="CAL_ADC0_DATA" width="16" begin="15" end="0" resetval="0x0" description="Signed ADC0 Data from CAL channel sample " range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_IRQSTATUS_RAW_SYS_0" acronym="RESOLVER_REGS_IRQSTATUS_RAW_SYS_0" offset="48" width="32" description="Interrupt Raw Status Register for Core0.">
		<bitfield id="TRACK_LOCK_ERR0" width="1" begin="24" end="24" resetval="0x0" description="Raw status of error interrupt for track_lock_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="24" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_HI_ERR0" width="1" begin="23" end="23" resetval="0x0" description="Raw status of error interrupt for offsetdrift_cos_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="23" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_LO_ERR0" width="1" begin="22" end="22" resetval="0x0" description="Raw status of error interrupt for offsetdrift_cos_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="22" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_HI_ERR0" width="1" begin="21" end="21" resetval="0x0" description="Raw status of error interrupt for offsetdrift_sin_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="21" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_LO_ERR0" width="1" begin="20" end="20" resetval="0x0" description="Raw status of error interrupt for offsetdrift_sin_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="20" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_HI_ERR0" width="1" begin="19" end="19" resetval="0x0" description="Raw status of error interrupt for gaindrift_cos_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="19" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_LO_ERR0" width="1" begin="18" end="18" resetval="0x0" description="Raw status of error interrupt for gaindrift_cos_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="18" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_HI_ERR0" width="1" begin="17" end="17" resetval="0x0" description="Raw status of error interrupt for gaindrift_sin_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="17" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_LO_ERR0" width="1" begin="16" end="16" resetval="0x0" description="Raw status of error interrupt for gaindrift_sin_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="16" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_HI_ERR0" width="1" begin="15" end="15" resetval="0x0" description="Raw status of error interrupt for phasedrift_cos_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="15" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_LO_ERR0" width="1" begin="14" end="14" resetval="0x0" description="Raw status of error interrupt for phasedrift_cos_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="14" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_HI_ERR0" width="1" begin="13" end="13" resetval="0x0" description="Raw status of error interrupt for excfreqdrift_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="13" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_COS_LO_ERR0" width="1" begin="12" end="12" resetval="0x0" description="Raw status of error interrupt for excfreqdrift_cos_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="12" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_SIN_LO_ERR0" width="1" begin="11" end="11" resetval="0x0" description="Raw status of error interrupt for excfreqdrift_sin_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="11" rwaccess="R/W1TS"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR0" width="1" begin="10" end="10" resetval="0x0" description="Raw status of error interrupt for sin_pos_zc_peak_mismatch_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="10" rwaccess="R/W1TS"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR0" width="1" begin="9" end="9" resetval="0x0" description="Raw status of error interrupt for sin_neg_zc_peak_mismatch_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="9" rwaccess="R/W1TS"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR0" width="1" begin="8" end="8" resetval="0x0" description="Raw status of error interrupt for cos_pos_zc_peak_mismatch_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="8" rwaccess="R/W1TS"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR0" width="1" begin="7" end="7" resetval="0x0" description="Raw status of error interrupt for cos_neg_zc_peak_mismatch_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="7" rwaccess="R/W1TS"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_ERR0" width="1" begin="6" end="6" resetval="0x0" description="Raw status of error interrupt for sin_multi_zc_error_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="6" rwaccess="R/W1TS"/>
	<bitfield id="COS_MULTI_ZC_ERROR_ERR0" width="1" begin="5" end="5" resetval="0x0" description="Raw status of error interrupt for cos_multi_zc_error_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="5" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_HI_ERR0" width="1" begin="4" end="4" resetval="0x0" description="Raw status of error interrupt for sinsqcossq_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="4" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_LO_ERR0" width="1" begin="3" end="3" resetval="0x0" description="Raw status of error interrupt for sinsqcossq_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_SIN_FAULT_ERR0" width="1" begin="2" end="2" resetval="0x0" description="Raw status of error interrupt for highamplitude_sin_fault_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_COS_FAULT_ERR0" width="1" begin="1" end="1" resetval="0x0" description="Raw status of error interrupt for highamplitude_cos_fault_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="LOWAMPLITUDE_ERR0" width="1" begin="0" end="0" resetval="0x0" description="Raw status of error interrupt for lowamplitude_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RESOLVER_REGS_IRQSTATUS_SYS_0" acronym="RESOLVER_REGS_IRQSTATUS_SYS_0" offset="52" width="32" description="Interrupt Status Register for Core0.">
		<bitfield id="TRACK_LOCK_ERR0" width="1" begin="24" end="24" resetval="0x0" description="Enabled status of  error interrupt for track_lock_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="24" rwaccess="R/W1TC"/>
	<bitfield id="OFFSETDRIFT_COS_HI_ERR0" width="1" begin="23" end="23" resetval="0x0" description="Enabled status of  error interrupt for offsetdrift_cos_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="23" rwaccess="R/W1TC"/>
	<bitfield id="OFFSETDRIFT_COS_LO_ERR0" width="1" begin="22" end="22" resetval="0x0" description="Enabled status of  error interrupt for offsetdrift_cos_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="22" rwaccess="R/W1TC"/>
	<bitfield id="OFFSETDRIFT_SIN_HI_ERR0" width="1" begin="21" end="21" resetval="0x0" description="Enabled status of  error interrupt for offsetdrift_sin_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="21" rwaccess="R/W1TC"/>
	<bitfield id="OFFSETDRIFT_SIN_LO_ERR0" width="1" begin="20" end="20" resetval="0x0" description="Enabled status of  error interrupt for offsetdrift_sin_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="20" rwaccess="R/W1TC"/>
	<bitfield id="GAINDRIFT_COS_HI_ERR0" width="1" begin="19" end="19" resetval="0x0" description="Enabled status of  error interrupt for gaindrift_cos_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="19" rwaccess="R/W1TC"/>
	<bitfield id="GAINDRIFT_COS_LO_ERR0" width="1" begin="18" end="18" resetval="0x0" description="Enabled status of  error interrupt for gaindrift_cos_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="18" rwaccess="R/W1TC"/>
	<bitfield id="GAINDRIFT_SIN_HI_ERR0" width="1" begin="17" end="17" resetval="0x0" description="Enabled status of  error interrupt for gaindrift_sin_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="17" rwaccess="R/W1TC"/>
	<bitfield id="GAINDRIFT_SIN_LO_ERR0" width="1" begin="16" end="16" resetval="0x0" description="Enabled status of  error interrupt for gaindrift_sin_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="16" rwaccess="R/W1TC"/>
	<bitfield id="PHASEDRIFT_COS_HI_ERR0" width="1" begin="15" end="15" resetval="0x0" description="Enabled status of  error interrupt for phasedrift_cos_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="15" rwaccess="R/W1TC"/>
	<bitfield id="PHASEDRIFT_COS_LO_ERR0" width="1" begin="14" end="14" resetval="0x0" description="Enabled status of  error interrupt for phasedrift_cos_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="14" rwaccess="R/W1TC"/>
	<bitfield id="EXCFREQDRIFT_HI_ERR0" width="1" begin="13" end="13" resetval="0x0" description="Enabled status of  error interrupt for excfreqdrift_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="13" rwaccess="R/W1TC"/>
	<bitfield id="EXCFREQDRIFT_COS_LO_ERR0" width="1" begin="12" end="12" resetval="0x0" description="Enabled status of  error interrupt for excfreqdrift_cos_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="12" rwaccess="R/W1TC"/>
	<bitfield id="EXCFREQDRIFT_SIN_LO_ERR0" width="1" begin="11" end="11" resetval="0x0" description="Enabled status of  error interrupt for excfreqdrift_sin_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="11" rwaccess="R/W1TC"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR0" width="1" begin="10" end="10" resetval="0x0" description="Enabled status of  error interrupt for sin_pos_zc_peak_mismatch_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="10" rwaccess="R/W1TC"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR0" width="1" begin="9" end="9" resetval="0x0" description="Enabled status of  error interrupt for sin_neg_zc_peak_mismatch_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="9" rwaccess="R/W1TC"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR0" width="1" begin="8" end="8" resetval="0x0" description="Enabled status of  error interrupt for cos_pos_zc_peak_mismatch_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="8" rwaccess="R/W1TC"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR0" width="1" begin="7" end="7" resetval="0x0" description="Enabled status of  error interrupt for cos_neg_zc_peak_mismatch_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="7" rwaccess="R/W1TC"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_ERR0" width="1" begin="6" end="6" resetval="0x0" description="Enabled status of  error interrupt for sin_multi_zc_error_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="6" rwaccess="R/W1TC"/>
	<bitfield id="COS_MULTI_ZC_ERROR_ERR0" width="1" begin="5" end="5" resetval="0x0" description="Enabled status of  error interrupt for cos_multi_zc_error_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="5" rwaccess="R/W1TC"/>
	<bitfield id="SINSQCOSSQ_HI_ERR0" width="1" begin="4" end="4" resetval="0x0" description="Enabled status of  error interrupt for sinsqcossq_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="4" rwaccess="R/W1TC"/>
	<bitfield id="SINSQCOSSQ_LO_ERR0" width="1" begin="3" end="3" resetval="0x0" description="Enabled status of  error interrupt for sinsqcossq_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="HIGHAMPLITUDE_SIN_FAULT_ERR0" width="1" begin="2" end="2" resetval="0x0" description="Enabled status of  error interrupt for highamplitude_sin_fault_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="HIGHAMPLITUDE_COS_FAULT_ERR0" width="1" begin="1" end="1" resetval="0x0" description="Enabled status of  error interrupt for highamplitude_cos_fault_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="LOWAMPLITUDE_ERR0" width="1" begin="0" end="0" resetval="0x0" description="Enabled status of  error interrupt for lowamplitude_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="RESOLVER_REGS_IRQENABLE_SET_SYS_0" acronym="RESOLVER_REGS_IRQENABLE_SET_SYS_0" offset="56" width="32" description="Interrupt Enable Set Register for Core0.">
		<bitfield id="TRACK_LOCK_ERR0" width="1" begin="24" end="24" resetval="0x0" description="Enable set for track_lock_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="24" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_HI_ERR0" width="1" begin="23" end="23" resetval="0x0" description="Enable set for offsetdrift_cos_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="23" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_LO_ERR0" width="1" begin="22" end="22" resetval="0x0" description="Enable set for offsetdrift_cos_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="22" rwaccess="R/W1TS"/>
