ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/RESOLVER_RESOLVER_REGS_502CB000h.xml
	<bitfield id="OFFSETDRIFT_SIN_HI_ERR0" width="1" begin="21" end="21" resetval="0x0" description="Enable set for offsetdrift_sin_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="21" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_LO_ERR0" width="1" begin="20" end="20" resetval="0x0" description="Enable set for offsetdrift_sin_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="20" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_HI_ERR0" width="1" begin="19" end="19" resetval="0x0" description="Enable set for gaindrift_cos_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="19" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_LO_ERR0" width="1" begin="18" end="18" resetval="0x0" description="Enable set for gaindrift_cos_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="18" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_HI_ERR0" width="1" begin="17" end="17" resetval="0x0" description="Enable set for gaindrift_sin_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="17" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_LO_ERR0" width="1" begin="16" end="16" resetval="0x0" description="Enable set for gaindrift_sin_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="16" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_HI_ERR0" width="1" begin="15" end="15" resetval="0x0" description="Enable set for phasedrift_cos_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="15" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_LO_ERR0" width="1" begin="14" end="14" resetval="0x0" description="Enable set for phasedrift_cos_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="14" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_HI_ERR0" width="1" begin="13" end="13" resetval="0x0" description="Enable set for excfreqdrift_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="13" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_COS_LO_ERR0" width="1" begin="12" end="12" resetval="0x0" description="Enable set for excfreqdrift_cos_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="12" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_SIN_LO_ERR0" width="1" begin="11" end="11" resetval="0x0" description="Enable set for excfreqdrift_sin_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="11" rwaccess="R/W1TS"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR0" width="1" begin="10" end="10" resetval="0x0" description="Enable set for sin_pos_zc_peak_mismatch_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="10" rwaccess="R/W1TS"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR0" width="1" begin="9" end="9" resetval="0x0" description="Enable set for sin_neg_zc_peak_mismatch_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="9" rwaccess="R/W1TS"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR0" width="1" begin="8" end="8" resetval="0x0" description="Enable set for cos_pos_zc_peak_mismatch_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="8" rwaccess="R/W1TS"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR0" width="1" begin="7" end="7" resetval="0x0" description="Enable set for cos_neg_zc_peak_mismatch_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="7" rwaccess="R/W1TS"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_ERR0" width="1" begin="6" end="6" resetval="0x0" description="Enable set for sin_multi_zc_error_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="6" rwaccess="R/W1TS"/>
	<bitfield id="COS_MULTI_ZC_ERROR_ERR0" width="1" begin="5" end="5" resetval="0x0" description="Enable set for cos_multi_zc_error_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="5" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_HI_ERR0" width="1" begin="4" end="4" resetval="0x0" description="Enable set for sinsqcossq_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="4" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_LO_ERR0" width="1" begin="3" end="3" resetval="0x0" description="Enable set for sinsqcossq_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_SIN_FAULT_ERR0" width="1" begin="2" end="2" resetval="0x0" description="Enable set for highamplitude_sin_fault_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_COS_FAULT_ERR0" width="1" begin="1" end="1" resetval="0x0" description="Enable set for highamplitude_cos_fault_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="LOWAMPLITUDE_ERR0" width="1" begin="0" end="0" resetval="0x0" description="Enable set for lowamplitude_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RESOLVER_REGS_IRQENABLE_CLR_SYS_0" acronym="RESOLVER_REGS_IRQENABLE_CLR_SYS_0" offset="60" width="32" description="Interrupt Enable Clear Register for Core0.">
		<bitfield id="TRACK_LOCK_ERR0" width="1" begin="24" end="24" resetval="0x0" description="Enable clr for track_lock_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="24" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_HI_ERR0" width="1" begin="23" end="23" resetval="0x0" description="Enable clr for offsetdrift_cos_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="23" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_LO_ERR0" width="1" begin="22" end="22" resetval="0x0" description="Enable clr for offsetdrift_cos_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="22" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_HI_ERR0" width="1" begin="21" end="21" resetval="0x0" description="Enable clr for offsetdrift_sin_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="21" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_LO_ERR0" width="1" begin="20" end="20" resetval="0x0" description="Enable clr for offsetdrift_sin_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="20" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_HI_ERR0" width="1" begin="19" end="19" resetval="0x0" description="Enable clr for gaindrift_cos_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="19" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_LO_ERR0" width="1" begin="18" end="18" resetval="0x0" description="Enable clr for gaindrift_cos_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="18" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_HI_ERR0" width="1" begin="17" end="17" resetval="0x0" description="Enable clr for gaindrift_sin_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="17" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_LO_ERR0" width="1" begin="16" end="16" resetval="0x0" description="Enable clr for gaindrift_sin_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="16" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_HI_ERR0" width="1" begin="15" end="15" resetval="0x0" description="Enable clr for phasedrift_cos_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="15" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_LO_ERR0" width="1" begin="14" end="14" resetval="0x0" description="Enable clr for phasedrift_cos_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="14" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_HI_ERR0" width="1" begin="13" end="13" resetval="0x0" description="Enable clr for excfreqdrift_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="13" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_COS_LO_ERR0" width="1" begin="12" end="12" resetval="0x0" description="Enable clr for excfreqdrift_cos_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="12" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_SIN_LO_ERR0" width="1" begin="11" end="11" resetval="0x0" description="Enable clr for excfreqdrift_sin_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="11" rwaccess="R/W1TS"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR0" width="1" begin="10" end="10" resetval="0x0" description="Enable clr for sin_pos_zc_peak_mismatch_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="10" rwaccess="R/W1TS"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR0" width="1" begin="9" end="9" resetval="0x0" description="Enable clr for sin_neg_zc_peak_mismatch_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="9" rwaccess="R/W1TS"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR0" width="1" begin="8" end="8" resetval="0x0" description="Enable clr for cos_pos_zc_peak_mismatch_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="8" rwaccess="R/W1TS"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR0" width="1" begin="7" end="7" resetval="0x0" description="Enable clr for cos_neg_zc_peak_mismatch_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="7" rwaccess="R/W1TS"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_ERR0" width="1" begin="6" end="6" resetval="0x0" description="Enable clr for sin_multi_zc_error_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="6" rwaccess="R/W1TS"/>
	<bitfield id="COS_MULTI_ZC_ERROR_ERR0" width="1" begin="5" end="5" resetval="0x0" description="Enable clr for cos_multi_zc_error_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="5" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_HI_ERR0" width="1" begin="4" end="4" resetval="0x0" description="Enable clr for sinsqcossq_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="4" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_LO_ERR0" width="1" begin="3" end="3" resetval="0x0" description="Enable clr for sinsqcossq_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_SIN_FAULT_ERR0" width="1" begin="2" end="2" resetval="0x0" description="Enable clr for highamplitude_sin_fault_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_COS_FAULT_ERR0" width="1" begin="1" end="1" resetval="0x0" description="Enable clr for highamplitude_cos_fault_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="LOWAMPLITUDE_ERR0" width="1" begin="0" end="0" resetval="0x0" description="Enable clr for lowamplitude_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RESOLVER_REGS_DC_OFF_CFG1_0" acronym="RESOLVER_REGS_DC_OFF_CFG1_0" offset="64" width="32" description="DC Offset Config1.">
		<bitfield id="OFF_CAL_COEF2" width="4" begin="31" end="28" resetval="0x0" description="Offset calibration coefficient2 dc offset" range="31:28" rwaccess="R/W"/>
	<bitfield id="OFF_CAL_COEF1" width="4" begin="27" end="24" resetval="0x0" description="Offset calibration coefficient1 dc offset" range="27:24" rwaccess="R/W"/>
	<bitfield id="FILTORDER" width="4" begin="15" end="12" resetval="0x10" description="NOT USED" range="15:12" rwaccess="R/W"/>
	<bitfield id="BANDPASSFILTER_ON" width="1" begin="8" end="8" resetval="0x0" description="To enable the bandpass filter before DC offset logix" range="8" rwaccess="R/W"/>
	<bitfield id="OFFSET_HYSTERESIS" width="4" begin="7" end="4" resetval="0x0" description=" unsigned. Absolute hysteresis limit.4b(no decimal points) with the16bLSB, ADC data coming16bto the resolver" range="7:4" rwaccess="R/W"/>
	<bitfield id="OFFSET_CORR_ON" width="1" begin="3" end="3" resetval="0x0" description="DC Offset Correction On" range="3" rwaccess="R/W"/>
	<bitfield id="COS_AUTO_OFFSET_EN" width="1" begin="1" end="1" resetval="0x0" description="NOT_USED" range="1" rwaccess="R/W"/>
	<bitfield id="SIN_AUTO_OFFSET_EN" width="1" begin="0" end="0" resetval="0x0" description="NOT USED" range="0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DC_OFF_CFG2_0" acronym="RESOLVER_REGS_DC_OFF_CFG2_0" offset="68" width="32" description="DC Offset Config2.">
		<bitfield id="COS_MAN_OFF_ADJ" width="16" begin="31" end="16" resetval="0x0" description="Signed Cos manual dc offset" range="31:16" rwaccess="R/W"/>
	<bitfield id="SIN_MAN_OFF_ADJ" width="16" begin="15" end="0" resetval="0x0" description="Signed Sin manual dc offset" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DC_OFF0" acronym="RESOLVER_REGS_DC_OFF0" offset="72" width="32" description="DC Offset.">
		<bitfield id="COS_OFFSET" width="16" begin="31" end="16" resetval="0x0" description="Signed Cos auto dc offset" range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_OFFSET" width="16" begin="15" end="0" resetval="0x0" description="Signed Sin auto dc offset" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_SAMPLE_CFG1_0" acronym="RESOLVER_REGS_SAMPLE_CFG1_0" offset="76" width="32" description="Ideal Sample Config1.">
		<bitfield id="IDEAL_SAMPLE_TIME_OVR" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample count Override" range="31:24" rwaccess="R/W"/>
	<bitfield id="IDEAL_SAMPLE_TIME" width="8" begin="23" end="16" resetval="0x0" description="Current Ideal sample count, round down" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAK_AVG_LIMIT" width="3" begin="15" end="13" resetval="0x0" description="2^n  peakaveragelimit is how many times to average the ideal peak point: 0 to 7" range="15:13" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_SAMPLE_CFG2_0" acronym="RESOLVER_REGS_SAMPLE_CFG2_0" offset="80" width="32" description="Ideal Sample Config2.">
		<bitfield id="SAMPLE_DET_THRESHOLD" width="16" begin="31" end="16" resetval="0x0" description="Abs value, the sig needs to be above to trigger the peak detect" range="31:16" rwaccess="R/W"/>
	<bitfield id="BANDPASSFILTERSAMPLEADJUST" width="5" begin="12" end="8" resetval="0x10" description="Offset compensate the ideal phase time selection if bpass filter enabled note when you are in manual mode, this value is not longer added " range="12:8" rwaccess="R/W"/>
	<bitfield id="PEAK_AVG_LIMIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="Ideal sample count training completed, Wrt 1 to Clr" range="0" rwaccess="R/W1TC"/>
	</register><register id="RESOLVER_REGS_DEC_GF_CFG0" acronym="RESOLVER_REGS_DEC_GF_CFG0" offset="84" width="32" description="Dec GF Config.">
		<bitfield id="IDEAL_SAMPLE_MODE" width="2" begin="26" end="25" resetval="0x0" description="Ideal sample time detection: 0 autodetect, 1 detect on sin channel 2 on cos channel 3 manual" range="26:25" rwaccess="R/W"/>
	<bitfield id="ENABLE_BOTTOM" width="1" begin="24" end="24" resetval="0x0" description="This enables bottom wave to get used in the avg" range="24" rwaccess="R/W"/>
	<bitfield id="NOISE_THRESHOLD" width="12" begin="11" end="0" resetval="0x0" description="Abs value, if above use the current moving avg, drop the new data" range="11:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG1_0" acronym="RESOLVER_REGS_PG_EST_CFG1_0" offset="88" width="32" description="Phase and Gain Est for correction block Config1.">
		<bitfield id="AGC_FILTER_COEF2" width="4" begin="31" end="28" resetval="0x0" description="NOT USED" range="31:28" rwaccess="R/W"/>
	<bitfield id="AGC_FILTER_COEF1" width="4" begin="27" end="24" resetval="0x0" description="NOT USED" range="27:24" rwaccess="R/W"/>
	<bitfield id="AUTOPHASEGAINREADYDONE" width="1" begin="16" end="16" resetval="0x0" description="Status of Auto Gain and Phase Est , set when ready for each cycle , wrt 1 to clear, this has no effect to the correction logic " range="16" rwaccess="R/W1TC"/>
	<bitfield id="PHASEFILTCOEFF" width="4" begin="7" end="4" resetval="0x0" description="NOT USED" range="7:4" rwaccess="R/W"/>
	<bitfield id="PG_TRAIN_LIMIT" width="4" begin="3" end="0" resetval="0x0" description="^n pg_train_limit : 0 to 15" range="3:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG2_0" acronym="RESOLVER_REGS_PG_EST_CFG2_0" offset="92" width="32" description="Phase and Gain Est for correction block Config2.">
		<bitfield id="PHASECOSBYP0" width="16" begin="31" end="16" resetval="0x0" description="Manual  Phase Cos correction value" range="31:16" rwaccess="R/W"/>
	<bitfield id="BYPASSPHASEGAINCORR0" width="1" begin="3" end="3" resetval="0x0" description="Enables phase and gain est " range="3" rwaccess="R/W"/>
	<bitfield id="AUTOPHASECONTROL0" width="1" begin="2" end="2" resetval="0x0" description="Enable  Auto Phase correction" range="2" rwaccess="R/W"/>
	<bitfield id="AUTOGAINCONTROL0" width="1" begin="1" end="1" resetval="0x0" description="Enable Auto Gain correction" range="1" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG3_0" acronym="RESOLVER_REGS_PG_EST_CFG3_0" offset="96" width="32" description="Phase and Gain Est for correction block Config3.">
		<bitfield id="GAINCOSBYP0" width="16" begin="31" end="16" resetval="0x0" description="Manual Gain Cos correction value" range="31:16" rwaccess="R/W"/>
	<bitfield id="GAINSINBYP0" width="16" begin="15" end="0" resetval="0x0" description="Manual Gain Sin correction value, always pos" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG4_0" acronym="RESOLVER_REGS_PG_EST_CFG4_0" offset="100" width="32" description="Phase and Gain Est for correction block Config4.">
		<bitfield id="PHASEESTIMATEFINAL" width="16" begin="31" end="16" resetval="0x0" description="Cos Auto Cal Phase correction value cal by est " range="31:16" rwaccess="RO"/>
	<bitfield id="PG_GLITCHTHRESHOLD" width="16" begin="15" end="0" resetval="0x16384" description="glitch threshold to estimate new rotation start in degrees" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG5_0" acronym="RESOLVER_REGS_PG_EST_CFG5_0" offset="104" width="32" description="Phase and Gain Est for correction block Config5.">
		<bitfield id="COSSQACCFINAL0" width="32" begin="31" end="0" resetval="0x0" description="Cos Auto Cal Gain correction value cal by est " range="31:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG6_0" acronym="RESOLVER_REGS_PG_EST_CFG6_0" offset="108" width="32" description="Phase and Gain Est for correction block Config6.">
		<bitfield id="SINSQACCFINAL0" width="32" begin="31" end="0" resetval="0x0" description="Sin Auto Cal Gain correction value cal by est " range="31:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_TRACK2_CFG1_0" acronym="RESOLVER_REGS_TRACK2_CFG1_0" offset="112" width="32" description="Track2 Kp, Ki, Kd, Kvelfilt, Kffw, Boost Cfg1 .">
		<bitfield id="KVELFILT" width="8" begin="31" end="24" resetval="0x5" description="Kvelfilt" range="31:24" rwaccess="R/W"/>
	<bitfield id="KD" width="8" begin="23" end="16" resetval="0x0" description="NOT USED" range="23:16" rwaccess="R/W"/>
	<bitfield id="KI" width="8" begin="15" end="8" resetval="0x60" description="Ki" range="15:8" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_TRACK2_CFG2_0" acronym="RESOLVER_REGS_TRACK2_CFG2_0" offset="116" width="32" description="Track2 Feed Fwd Boost Kffw Cfg2.">
		<bitfield id="KFFW" width="8" begin="11" end="4" resetval="0x6" description="Kffw" range="11:4" rwaccess="R/W"/>
	<bitfield id="EARLYESTIMATE" width="1" begin="2" end="2" resetval="0x0" description="NOT USED" range="2" rwaccess="R/W"/>
	<bitfield id="BOOST" width="1" begin="1" end="1" resetval="0x1" description="Boost Enable" range="1" rwaccess="R/W"/>
	<bitfield id="FEED_FWD_CORR" width="1" begin="0" end="0" resetval="0x0" description="NOT USED" range="0" rwaccess="R/W"/>
