ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/RESOLVER_RESOLVER_REGS_502CB000h.xml
	</register><register id="RESOLVER_REGS_TRACK2_CFG3_0" acronym="RESOLVER_REGS_TRACK2_CFG3_0" offset="120" width="32" description="Track2 Cfg3.">
		<bitfield id="BOOSTVEL" width="1" begin="24" end="24" resetval="0x0" description="0 disables and 1 enables  accel/decel compensation for velocity calculation. boost also needs to be 1	" range="24" rwaccess="R/W"/>
	<bitfield id="KPDIV" width="8" begin="15" end="8" resetval="0x0" description="Kp proportional path gain" range="15:8" rwaccess="R/W"/>
	<bitfield id="VBOOSTCOEFF" width="8" begin="7" end="0" resetval="0x0" description="unsigned velocity accel/decel comp coefficient" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_ANGLE_ARCTAN_0" acronym="RESOLVER_REGS_ANGLE_ARCTAN_0" offset="124" width="32" description="Angle and Velocity from acrtan .">
		<bitfield id="ANGLE" width="16" begin="15" end="0" resetval="0x0" description="Signed(2s complement) Angle from arctan -180  to 0  to +180 scaled" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_ANGLE_TRACK2_0" acronym="RESOLVER_REGS_ANGLE_TRACK2_0" offset="128" width="32" description="Angle and Velocity from track2.">
		<bitfield id="ANGLE" width="16" begin="15" end="0" resetval="0x0" description="Signed(2s complement) Angle from track2 -180  to 0  to +180 scaled" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_VELOCITY_TRACK2_0" acronym="RESOLVER_REGS_VELOCITY_TRACK2_0" offset="132" width="32" description="Angle and Velocity from track2.">
		<bitfield id="VELOCITY" width="32" begin="31" end="0" resetval="0x0" description="This register gives rotation frequency as a function of exc freq and double/single sample mode. Formula on matlab comment. (rotation frequency in Hz, signed based on direction) =  (velocity) * (1/Ts) * 1/2^32  Note: if it's top/bottom sampling, Ts = Texc/2, otherwise Ts=Texc" range="31:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OFFSET_0" acronym="RESOLVER_REGS_OFFSET_0" offset="136" width="32" description="SIN and COS Offset.">
		</register><register id="RESOLVER_REGS_DIAG1_0" acronym="RESOLVER_REGS_DIAG1_0" offset="152" width="32" description="Diag1 0">
		<bitfield id="OFFSETDRIFT_THRESHOLD_LO" width="16" begin="31" end="16" resetval="0x0" description="Signed Lo threshold to detect offset drift" range="31:16" rwaccess="R/W"/>
	<bitfield id="OFFSETDRIFT_THRESHOLD_HI" width="16" begin="15" end="0" resetval="0x0" description="Signed Hi threshold to detect offsetdrift" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG2_0" acronym="RESOLVER_REGS_DIAG2_0" offset="156" width="32" description="Diag2 0">
		<bitfield id="EXCFREQDETECTED_COS" width="16" begin="31" end="16" resetval="0x0" description="SW OBS Counts detected between zcs for cos excitation frequency" range="31:16" rwaccess="RO"/>
	<bitfield id="EXCFREQDETECTED_SIN" width="16" begin="15" end="0" resetval="0x0" description="SW OBS Counts detected between zcs for sin excitation frequency" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG3_0" acronym="RESOLVER_REGS_DIAG3_0" offset="160" width="32" description="Diag3 0">
		<bitfield id="EXCFREQDRIFT_THRESHOLD_LO" width="16" begin="31" end="16" resetval="0x0" description="Lo threshold to detect excfreqdrift" range="31:16" rwaccess="R/W"/>
	<bitfield id="EXCFREQDRIFT_THRESHOLD_HI" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect excfreqdrift" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG4_0" acronym="RESOLVER_REGS_DIAG4_0" offset="164" width="32" description="Diag4 0">
		<bitfield id="EXCFREQDRIFT_GLITCHCOUNT" width="8" begin="23" end="16" resetval="0x1" description="Counter limit, how many times before issuing error" range="23:16" rwaccess="R/W"/>
	<bitfield id="EXCFREQ_LEVEL" width="16" begin="15" end="0" resetval="0x0" description="Threshold on ADC value to detect sin or cos zero crossings" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG5_0" acronym="RESOLVER_REGS_DIAG5_0" offset="168" width="32" description="Diag5 0">
		<bitfield id="LOWAMPLITUDE_GLITCHCOUNT" width="8" begin="23" end="16" resetval="0x1" description="Counter limit, how many times before issuing error" range="23:16" rwaccess="R/W"/>
	<bitfield id="LOWAMPLITUDE_THRESHOLD" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect lowamplitude. Both sin and cos need to be lower than this at the same time" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG6_0" acronym="RESOLVER_REGS_DIAG6_0" offset="172" width="32" description="Diag6 0">
		<bitfield id="LOWAMPLITUDE_COS" width="16" begin="31" end="16" resetval="0x0" description="Value of cos channel at the error trigger instant" range="31:16" rwaccess="RO"/>
	<bitfield id="LOWAMPLITUDE_SIN" width="16" begin="15" end="0" resetval="0x0" description="Value of sin channel at the error trigger instant" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG7_0" acronym="RESOLVER_REGS_DIAG7_0" offset="176" width="32" description="Diag7 0">
		<bitfield id="HIGHAMPLITUDE_GLITCHCOUNT" width="8" begin="23" end="16" resetval="0x1" description="Counter limit, how many times before issuing error" range="23:16" rwaccess="R/W"/>
	<bitfield id="HIGHAMPLITUDE_THRESHOLD" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect highamplitude. Both sin and cos need to be higher than this at the same time" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG8_0" acronym="RESOLVER_REGS_DIAG8_0" offset="180" width="32" description="Diag8 0">
		<bitfield id="HIGHAMPLITUDE_COS" width="16" begin="31" end="16" resetval="0x0" description="Value of cos channel at the error trigger instant" range="31:16" rwaccess="RO"/>
	<bitfield id="HIGHAMPLITUDE_SIN" width="16" begin="15" end="0" resetval="0x0" description="Value of sin channel at the error trigger instant" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG9_0" acronym="RESOLVER_REGS_DIAG9_0" offset="184" width="32" description="Diag9 0">
		<bitfield id="SINSQCOSSQ_THRESHOLD_HI" width="16" begin="31" end="16" resetval="0x0" description="High threshold to detect sinsqcossq. Sin^2+Cos^2 s needs to be lower than this" range="31:16" rwaccess="R/W"/>
	<bitfield id="SINSQCOSSQ_THRESHOLD_LO" width="16" begin="15" end="0" resetval="0x0" description="Low threshold to detect sinsqcossq. Sin^2+Cos^2 s needs to be lower than this" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG10_0" acronym="RESOLVER_REGS_DIAG10_0" offset="188" width="32" description="Diag10 0">
		<bitfield id="SINSQCOSSQ_COSSQ" width="16" begin="31" end="16" resetval="0x0" description="Actual cossq value on error trigger ether lo or hi triggered, first event" range="31:16" rwaccess="RO"/>
	<bitfield id="SINSQCOSSQ_SINSQ" width="16" begin="15" end="0" resetval="0x0" description="Actual sinsq value on error trigger ether lo or hi triggered, first event" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG11_0" acronym="RESOLVER_REGS_DIAG11_0" offset="192" width="32" description="Diag11 0">
		<bitfield id="SINSQCOSSQ_GLITCHCOUNT" width="8" begin="7" end="0" resetval="0x1" description="Counter limit, how many times before issuing error" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG12_0" acronym="RESOLVER_REGS_DIAG12_0" offset="196" width="32" description="Diag12 0">
		<bitfield id="ROTPEAK_LEVEL" width="16" begin="31" end="16" resetval="0x0" description="Peak level of rotational sin/cos when other signal is zero crossing" range="31:16" rwaccess="R/W"/>
	<bitfield id="ROTFREQ_LEVEL" width="16" begin="15" end="0" resetval="0x0" description="Zero crossing detection level of rotational sin/cos" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG13_0" acronym="RESOLVER_REGS_DIAG13_0" offset="200" width="32" description="Diag13 0">
		<bitfield id="COS_MULTI_ZC_ERROR_COUNT" width="8" begin="31" end="24" resetval="0x0" description="Status of cos	Capture number of faulty zcs" range="31:24" rwaccess="RO"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_COUNT" width="8" begin="23" end="16" resetval="0x0" description="Status of sin	Capture number of faulty zcs" range="23:16" rwaccess="RO"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR" width="1" begin="3" end="3" resetval="0x0" description="During negative cos zero-crossing cos is not + or - peak" range="3" rwaccess="RO"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR" width="1" begin="2" end="2" resetval="0x0" description="During positive cos zero-croscosg cos is not + or - peak" range="2" rwaccess="RO"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR" width="1" begin="1" end="1" resetval="0x0" description="During negative sin zero-crossing cos is not + or - peak" range="1" rwaccess="RO"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR" width="1" begin="0" end="0" resetval="0x0" description="During positive sin zero-crossing cos is not + or - peak" range="0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG14_0" acronym="RESOLVER_REGS_DIAG14_0" offset="204" width="32" description="Diag14 0">
		<bitfield id="GAINDRIFT_THRESHOLD_LO" width="16" begin="31" end="16" resetval="0x0" description="Lo threshold to detect cos_gain drift" range="31:16" rwaccess="R/W"/>
	<bitfield id="GAINDRIFT_THRESHOLD_HI" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect cos_gain drift" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG15_0" acronym="RESOLVER_REGS_DIAG15_0" offset="208" width="32" description="Diag15 0">
		<bitfield id="GAINDRIFT_GLITCHCOUNT" width="8" begin="7" end="0" resetval="0x1" description="Counter limit, how many times before issuing error" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG16_0" acronym="RESOLVER_REGS_DIAG16_0" offset="212" width="32" description="Diag16 0">
		<bitfield id="PHASEDRIFT_THRESHOLD_LO" width="16" begin="31" end="16" resetval="0x0" description="Lo threshold to detect cos phase drift" range="31:16" rwaccess="R/W"/>
	<bitfield id="PHASEDRIFT_THRESHOLD_HI" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect cos phase drift" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG17_0" acronym="RESOLVER_REGS_DIAG17_0" offset="216" width="32" description="Diag17 0">
		<bitfield id="PHASEDRIFT_GLITCHCOUNT" width="8" begin="7" end="0" resetval="0x1" description="Counter limit, how many times before issuing error" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG18_0" acronym="RESOLVER_REGS_DIAG18_0" offset="220" width="32" description="Diag18 0">
		<bitfield id="TRACK_ERR_GLITCH_TIME" width="8" begin="23" end="16" resetval="0x1" description="NOT USED " range="23:16" rwaccess="R/W"/>
	<bitfield id="TRACK_ERR_THRESHOLD" width="16" begin="15" end="0" resetval="0x0" description="Tracking error treshold" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_OBS_ADC_0" acronym="RESOLVER_REGS_OBS_ADC_0" offset="236" width="32" description="Sw Obs adc data post latch and avg if enabled   ">
		<bitfield id="COS_ADC" width="16" begin="31" end="16" resetval="0x0" description="Signed SW Obs adc data post latch and avg if enabled " range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_ADC" width="16" begin="15" end="0" resetval="0x0" description="Signed SW Obs adc data post latch and avg if enabled " range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_ADC_REC_0" acronym="RESOLVER_REGS_OBS_ADC_REC_0" offset="240" width="32" description="Sw Obs adc data post recovered data, so post dec  ">
		<bitfield id="COS_REC" width="16" begin="31" end="16" resetval="0x0" description="Signed SW Ob sadc data post recovered data, so post dec " range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_REC" width="16" begin="15" end="0" resetval="0x0" description="Signed SW Obs adc data post recovered data, so post dec " range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_ADC_DC_0" acronym="RESOLVER_REGS_OBS_ADC_DC_0" offset="244" width="32" description="Sw Obs adc data post dc offset.">
		<bitfield id="COS_DC" width="16" begin="31" end="16" resetval="0x0" description="Signed SW Obs adc data post dc offset  " range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_DC" width="16" begin="15" end="0" resetval="0x0" description="Signed SW Obs adc data post dc offset   " range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_ADC_PGC_0" acronym="RESOLVER_REGS_OBS_ADC_PGC_0" offset="248" width="32" description="Sw Obs post phase and gain correction .">
		<bitfield id="COS_PGC" width="16" begin="31" end="16" resetval="0x0" description="Signed SW Obs adc data post phase and gain correction " range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_PGC" width="16" begin="15" end="0" resetval="0x0" description="Signed SW Obs adc data post phase and gain correction " range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM3_0_0" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM3_0_0" offset="256" width="32" description="SW obs peak histogram buckets.">
		<bitfield id="PEAKHISTOGRAM3_0" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket3" range="31:24" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM2_0" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket2" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM1_0" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket1" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM0_0" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket0" range="7:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM7_4_0" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM7_4_0" offset="260" width="32" description="SW obs peak histogram buckets .">
		<bitfield id="PEAKHISTOGRAM7_0" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket7" range="31:24" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM6_0" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket6" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM5_0" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket5" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM4_0" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket4" range="7:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM11_8_0" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM11_8_0" offset="264" width="32" description="SW obs peak histogram buckets .">
		<bitfield id="PEAKHISTOGRAM11_0" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket11" range="31:24" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM10_0" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket10" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM9_0" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket9" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM8_0" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket8" range="7:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM15_12_0" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM15_12_0" offset="268" width="32" description="SW obs peak histogram buckets .">
		<bitfield id="PEAKHISTOGRAM15_0" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket15" range="31:24" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM14_0" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket14" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM13_0" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket13" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM12_0" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket12" range="7:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM19_16_0" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM19_16_0" offset="272" width="32" description="SW obs peak histogram buckets .">
		<bitfield id="PEAKHISTOGRAM19_0" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket19" range="31:24" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM18_0" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket18" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM17_0" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket17" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM16_0" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket16" range="7:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_IRQSTATUS_RAW_SYS_1" acronym="RESOLVER_REGS_IRQSTATUS_RAW_SYS_1" offset="512" width="32" description="Interrupt Raw Status Register for Core1.">
		<bitfield id="TRACK_LOCK_ERR1" width="1" begin="24" end="24" resetval="0x0" description="Raw status of error interrupt for track_lock_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="24" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_HI_ERR1" width="1" begin="23" end="23" resetval="0x0" description="Raw status of error interrupt for offsetdrift_cos_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="23" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_LO_ERR1" width="1" begin="22" end="22" resetval="0x0" description="Raw status of error interrupt for offsetdrift_cos_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="22" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_HI_ERR1" width="1" begin="21" end="21" resetval="0x0" description="Raw status of error interrupt for offsetdrift_sin_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="21" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_LO_ERR1" width="1" begin="20" end="20" resetval="0x0" description="Raw status of error interrupt for offsetdrift_sin_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="20" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_HI_ERR1" width="1" begin="19" end="19" resetval="0x0" description="Raw status of error interrupt for gaindrift_cos_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="19" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_LO_ERR1" width="1" begin="18" end="18" resetval="0x0" description="Raw status of error interrupt for gaindrift_cos_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="18" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_HI_ERR1" width="1" begin="17" end="17" resetval="0x0" description="Raw status of error interrupt for gaindrift_sin_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="17" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_LO_ERR1" width="1" begin="16" end="16" resetval="0x0" description="Raw status of error interrupt for gaindrift_sin_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="16" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_HI_ERR1" width="1" begin="15" end="15" resetval="0x0" description="Raw status of error interrupt for phasedrift_cos_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="15" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_LO_ERR1" width="1" begin="14" end="14" resetval="0x0" description="Raw status of error interrupt for phasedrift_cos_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="14" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_HI_ERR1" width="1" begin="13" end="13" resetval="0x0" description="Raw status of error interrupt for excfreqdrift_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="13" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_COS_LO_ERR1" width="1" begin="12" end="12" resetval="0x0" description="Raw status of error interrupt for excfreqdrift_cos_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="12" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_SIN_LO_ERR1" width="1" begin="11" end="11" resetval="0x0" description="Raw status of error interrupt for excfreqdrift_sin_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="11" rwaccess="R/W1TS"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR1" width="1" begin="10" end="10" resetval="0x0" description="Raw status of error interrupt for sin_pos_zc_peak_mismatch_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="10" rwaccess="R/W1TS"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR1" width="1" begin="9" end="9" resetval="0x0" description="Raw status of error interrupt for sin_neg_zc_peak_mismatch_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="9" rwaccess="R/W1TS"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR1" width="1" begin="8" end="8" resetval="0x0" description="Raw status of error interrupt for cos_pos_zc_peak_mismatch_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="8" rwaccess="R/W1TS"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR1" width="1" begin="7" end="7" resetval="0x0" description="Raw status of error interrupt for cos_neg_zc_peak_mismatch_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="7" rwaccess="R/W1TS"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_ERR1" width="1" begin="6" end="6" resetval="0x0" description="Raw status of error interrupt for sin_multi_zc_error_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="6" rwaccess="R/W1TS"/>
	<bitfield id="COS_MULTI_ZC_ERROR_ERR1" width="1" begin="5" end="5" resetval="0x0" description="Raw status of error interrupt for cos_multi_zc_error_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="5" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_HI_ERR1" width="1" begin="4" end="4" resetval="0x0" description="Raw status of error interrupt for sinsqcossq_hi_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="4" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_LO_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Raw status of error interrupt for sinsqcossq_lo_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_SIN_FAULT_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Raw status of error interrupt for highamplitude_sin_fault_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_COS_FAULT_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Raw status of error interrupt for highamplitude_cos_fault_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="LOWAMPLITUDE_ERR1" width="1" begin="0" end="0" resetval="0x0" description="Raw status of error interrupt for lowamplitude_err Write 1 to set the (raw) status, mostly for debug. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RESOLVER_REGS_IRQSTATUS_SYS_1" acronym="RESOLVER_REGS_IRQSTATUS_SYS_1" offset="516" width="32" description="Interrupt Status Register for Core1.">
