ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/RESOLVER_RESOLVER_REGS_502CB000h.xml
		<bitfield id="TRACK_LOCK_ERR1" width="1" begin="24" end="24" resetval="0x0" description="Enabled status of  error interrupt for track_lock_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="24" rwaccess="R/W1TC"/>
	<bitfield id="OFFSETDRIFT_COS_HI_ERR1" width="1" begin="23" end="23" resetval="0x0" description="Enabled status of  error interrupt for offsetdrift_cos_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="23" rwaccess="R/W1TC"/>
	<bitfield id="OFFSETDRIFT_COS_LO_ERR1" width="1" begin="22" end="22" resetval="0x0" description="Enabled status of  error interrupt for offsetdrift_cos_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="22" rwaccess="R/W1TC"/>
	<bitfield id="OFFSETDRIFT_SIN_HI_ERR1" width="1" begin="21" end="21" resetval="0x0" description="Enabled status of  error interrupt for offsetdrift_sin_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="21" rwaccess="R/W1TC"/>
	<bitfield id="OFFSETDRIFT_SIN_LO_ERR1" width="1" begin="20" end="20" resetval="0x0" description="Enabled status of  error interrupt for offsetdrift_sin_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="20" rwaccess="R/W1TC"/>
	<bitfield id="GAINDRIFT_COS_HI_ERR1" width="1" begin="19" end="19" resetval="0x0" description="Enabled status of  error interrupt for gaindrift_cos_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="19" rwaccess="R/W1TC"/>
	<bitfield id="GAINDRIFT_COS_LO_ERR1" width="1" begin="18" end="18" resetval="0x0" description="Enabled status of  error interrupt for gaindrift_cos_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="18" rwaccess="R/W1TC"/>
	<bitfield id="GAINDRIFT_SIN_HI_ERR1" width="1" begin="17" end="17" resetval="0x0" description="Enabled status of  error interrupt for gaindrift_sin_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="17" rwaccess="R/W1TC"/>
	<bitfield id="GAINDRIFT_SIN_LO_ERR1" width="1" begin="16" end="16" resetval="0x0" description="Enabled status of  error interrupt for gaindrift_sin_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="16" rwaccess="R/W1TC"/>
	<bitfield id="PHASEDRIFT_COS_HI_ERR1" width="1" begin="15" end="15" resetval="0x0" description="Enabled status of  error interrupt for phasedrift_cos_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="15" rwaccess="R/W1TC"/>
	<bitfield id="PHASEDRIFT_COS_LO_ERR1" width="1" begin="14" end="14" resetval="0x0" description="Enabled status of  error interrupt for phasedrift_cos_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="14" rwaccess="R/W1TC"/>
	<bitfield id="EXCFREQDRIFT_HI_ERR1" width="1" begin="13" end="13" resetval="0x0" description="Enabled status of  error interrupt for excfreqdrift_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="13" rwaccess="R/W1TC"/>
	<bitfield id="EXCFREQDRIFT_COS_LO_ERR1" width="1" begin="12" end="12" resetval="0x0" description="Enabled status of  error interrupt for excfreqdrift_cos_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="12" rwaccess="R/W1TC"/>
	<bitfield id="EXCFREQDRIFT_SIN_LO_ERR1" width="1" begin="11" end="11" resetval="0x0" description="Enabled status of  error interrupt for excfreqdrift_sin_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="11" rwaccess="R/W1TC"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR1" width="1" begin="10" end="10" resetval="0x0" description="Enabled status of  error interrupt for sin_pos_zc_peak_mismatch_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="10" rwaccess="R/W1TC"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR1" width="1" begin="9" end="9" resetval="0x0" description="Enabled status of  error interrupt for sin_neg_zc_peak_mismatch_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="9" rwaccess="R/W1TC"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR1" width="1" begin="8" end="8" resetval="0x0" description="Enabled status of  error interrupt for cos_pos_zc_peak_mismatch_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="8" rwaccess="R/W1TC"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR1" width="1" begin="7" end="7" resetval="0x0" description="Enabled status of  error interrupt for cos_neg_zc_peak_mismatch_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="7" rwaccess="R/W1TC"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_ERR1" width="1" begin="6" end="6" resetval="0x0" description="Enabled status of  error interrupt for sin_multi_zc_error_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="6" rwaccess="R/W1TC"/>
	<bitfield id="COS_MULTI_ZC_ERROR_ERR1" width="1" begin="5" end="5" resetval="0x0" description="Enabled status of  error interrupt for cos_multi_zc_error_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="5" rwaccess="R/W1TC"/>
	<bitfield id="SINSQCOSSQ_HI_ERR1" width="1" begin="4" end="4" resetval="0x0" description="Enabled status of  error interrupt for sinsqcossq_hi_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="4" rwaccess="R/W1TC"/>
	<bitfield id="SINSQCOSSQ_LO_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Enabled status of  error interrupt for sinsqcossq_lo_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="HIGHAMPLITUDE_SIN_FAULT_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Enabled status of  error interrupt for highamplitude_sin_fault_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="HIGHAMPLITUDE_COS_FAULT_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Enabled status of  error interrupt for highamplitude_cos_fault_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="LOWAMPLITUDE_ERR1" width="1" begin="0" end="0" resetval="0x0" description="Enabled status of  error interrupt for lowamplitude_err  Write 1 to clear the status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="RESOLVER_REGS_IRQENABLE_SET_SYS_1" acronym="RESOLVER_REGS_IRQENABLE_SET_SYS_1" offset="520" width="32" description="Interrupt Enable Set Register for Core1.">
		<bitfield id="TRACK_LOCK_ERR1" width="1" begin="24" end="24" resetval="0x0" description="Enable set for track_lock_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="24" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_HI_ERR1" width="1" begin="23" end="23" resetval="0x0" description="Enable set for offsetdrift_cos_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="23" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_LO_ERR1" width="1" begin="22" end="22" resetval="0x0" description="Enable set for offsetdrift_cos_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="22" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_HI_ERR1" width="1" begin="21" end="21" resetval="0x0" description="Enable set for offsetdrift_sin_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="21" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_LO_ERR1" width="1" begin="20" end="20" resetval="0x0" description="Enable set for offsetdrift_sin_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="20" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_HI_ERR1" width="1" begin="19" end="19" resetval="0x0" description="Enable set for gaindrift_cos_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="19" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_LO_ERR1" width="1" begin="18" end="18" resetval="0x0" description="Enable set for gaindrift_cos_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="18" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_HI_ERR1" width="1" begin="17" end="17" resetval="0x0" description="Enable set for gaindrift_sin_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="17" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_LO_ERR1" width="1" begin="16" end="16" resetval="0x0" description="Enable set for gaindrift_sin_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="16" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_HI_ERR1" width="1" begin="15" end="15" resetval="0x0" description="Enable set for phasedrift_cos_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="15" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_LO_ERR1" width="1" begin="14" end="14" resetval="0x0" description="Enable set for phasedrift_cos_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="14" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_HI_ERR1" width="1" begin="13" end="13" resetval="0x0" description="Enable set for excfreqdrift_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="13" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_COS_LO_ERR1" width="1" begin="12" end="12" resetval="0x0" description="Enable set for excfreqdrift_cos_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="12" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_SIN_LO_ERR1" width="1" begin="11" end="11" resetval="0x0" description="Enable set for excfreqdrift_sin_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="11" rwaccess="R/W1TS"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR1" width="1" begin="10" end="10" resetval="0x0" description="Enable set for sin_pos_zc_peak_mismatch_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="10" rwaccess="R/W1TS"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR1" width="1" begin="9" end="9" resetval="0x0" description="Enable set for sin_neg_zc_peak_mismatch_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="9" rwaccess="R/W1TS"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR1" width="1" begin="8" end="8" resetval="0x0" description="Enable set for cos_pos_zc_peak_mismatch_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="8" rwaccess="R/W1TS"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR1" width="1" begin="7" end="7" resetval="0x0" description="Enable set for cos_neg_zc_peak_mismatch_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="7" rwaccess="R/W1TS"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_ERR1" width="1" begin="6" end="6" resetval="0x0" description="Enable set for sin_multi_zc_error_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="6" rwaccess="R/W1TS"/>
	<bitfield id="COS_MULTI_ZC_ERROR_ERR1" width="1" begin="5" end="5" resetval="0x0" description="Enable set for cos_multi_zc_error_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="5" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_HI_ERR1" width="1" begin="4" end="4" resetval="0x0" description="Enable set for sinsqcossq_hi_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="4" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_LO_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Enable set for sinsqcossq_lo_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_SIN_FAULT_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Enable set for highamplitude_sin_fault_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_COS_FAULT_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Enable set for highamplitude_cos_fault_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="LOWAMPLITUDE_ERR1" width="1" begin="0" end="0" resetval="0x0" description="Enable set for lowamplitude_err . Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RESOLVER_REGS_IRQENABLE_CLR_SYS_1" acronym="RESOLVER_REGS_IRQENABLE_CLR_SYS_1" offset="524" width="32" description="Interrupt Enable Clear Register for Core1.">
		<bitfield id="TRACK_LOCK_ERR1" width="1" begin="24" end="24" resetval="0x0" description="Enable clr for track_lock_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="24" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_HI_ERR1" width="1" begin="23" end="23" resetval="0x0" description="Enable clr for offsetdrift_cos_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="23" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_COS_LO_ERR1" width="1" begin="22" end="22" resetval="0x0" description="Enable clr for offsetdrift_cos_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="22" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_HI_ERR1" width="1" begin="21" end="21" resetval="0x0" description="Enable clr for offsetdrift_sin_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="21" rwaccess="R/W1TS"/>
	<bitfield id="OFFSETDRIFT_SIN_LO_ERR1" width="1" begin="20" end="20" resetval="0x0" description="Enable clr for offsetdrift_sin_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="20" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_HI_ERR1" width="1" begin="19" end="19" resetval="0x0" description="Enable clr for gaindrift_cos_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="19" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_COS_LO_ERR1" width="1" begin="18" end="18" resetval="0x0" description="Enable clr for gaindrift_cos_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="18" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_HI_ERR1" width="1" begin="17" end="17" resetval="0x0" description="Enable clr for gaindrift_sin_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="17" rwaccess="R/W1TS"/>
	<bitfield id="GAINDRIFT_SIN_LO_ERR1" width="1" begin="16" end="16" resetval="0x0" description="Enable clr for gaindrift_sin_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="16" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_HI_ERR1" width="1" begin="15" end="15" resetval="0x0" description="Enable clr for phasedrift_cos_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="15" rwaccess="R/W1TS"/>
	<bitfield id="PHASEDRIFT_COS_LO_ERR1" width="1" begin="14" end="14" resetval="0x0" description="Enable clr for phasedrift_cos_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="14" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_HI_ERR1" width="1" begin="13" end="13" resetval="0x0" description="Enable clr for excfreqdrift_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="13" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_COS_LO_ERR1" width="1" begin="12" end="12" resetval="0x0" description="Enable clr for excfreqdrift_cos_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="12" rwaccess="R/W1TS"/>
	<bitfield id="EXCFREQDRIFT_SIN_LO_ERR1" width="1" begin="11" end="11" resetval="0x0" description="Enable clr for excfreqdrift_sin_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="11" rwaccess="R/W1TS"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR1" width="1" begin="10" end="10" resetval="0x0" description="Enable clr for sin_pos_zc_peak_mismatch_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="10" rwaccess="R/W1TS"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR1" width="1" begin="9" end="9" resetval="0x0" description="Enable clr for sin_neg_zc_peak_mismatch_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="9" rwaccess="R/W1TS"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR1" width="1" begin="8" end="8" resetval="0x0" description="Enable clr for cos_pos_zc_peak_mismatch_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="8" rwaccess="R/W1TS"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR1" width="1" begin="7" end="7" resetval="0x0" description="Enable clr for cos_neg_zc_peak_mismatch_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="7" rwaccess="R/W1TS"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_ERR1" width="1" begin="6" end="6" resetval="0x0" description="Enable clr for sin_multi_zc_error_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="6" rwaccess="R/W1TS"/>
	<bitfield id="COS_MULTI_ZC_ERROR_ERR1" width="1" begin="5" end="5" resetval="0x0" description="Enable clr for cos_multi_zc_error_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="5" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_HI_ERR1" width="1" begin="4" end="4" resetval="0x0" description="Enable clr for sinsqcossq_hi_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="4" rwaccess="R/W1TS"/>
	<bitfield id="SINSQCOSSQ_LO_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Enable clr for sinsqcossq_lo_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="HIGHAMPLITUDE_SIN_FAULT_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Enable clr for highamplitude_sin_fault_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
