ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/RESOLVER_RESOLVER_REGS_502CB000h.xml
	<bitfield id="HIGHAMPLITUDE_COS_FAULT_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Enable clr for highamplitude_cos_fault_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="LOWAMPLITUDE_ERR1" width="1" begin="0" end="0" resetval="0x0" description="Enable clr for lowamplitude_err. Writing a 1 will disable the interrupt, and set this bit as well as the corresponding Interrupt Enable set Register. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RESOLVER_REGS_DC_OFF_CFG1_1" acronym="RESOLVER_REGS_DC_OFF_CFG1_1" offset="528" width="32" description="DC Offset Config1.">
		<bitfield id="OFF_CAL_COEF2" width="4" begin="31" end="28" resetval="0x0" description="Offset calibration coefficient2 dc offset" range="31:28" rwaccess="R/W"/>
	<bitfield id="OFF_CAL_COEF1" width="4" begin="27" end="24" resetval="0x0" description="Offset calibration coefficient1 dc offset" range="27:24" rwaccess="R/W"/>
	<bitfield id="FILTORDER" width="4" begin="15" end="12" resetval="0x10" description="NOT USED" range="15:12" rwaccess="R/W"/>
	<bitfield id="BANDPASSFILTER_ON" width="1" begin="8" end="8" resetval="0x0" description="To enable the bandpass filter before DC offset logix" range="8" rwaccess="R/W"/>
	<bitfield id="OFFSET_HYSTERESIS" width="4" begin="7" end="4" resetval="0x0" description=" unsigned. Absolute hysteresis limit.4b(no decimal points) with the16bLSB, ADC data coming16bto the resolver" range="7:4" rwaccess="R/W"/>
	<bitfield id="OFFSET_CORR_ON" width="1" begin="3" end="3" resetval="0x0" description="DC Offset Correction On" range="3" rwaccess="R/W"/>
	<bitfield id="COS_AUTO_OFFSET_EN" width="1" begin="1" end="1" resetval="0x0" description="NOT_USED" range="1" rwaccess="R/W"/>
	<bitfield id="SIN_AUTO_OFFSET_EN" width="1" begin="0" end="0" resetval="0x0" description="NOT USED" range="0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DC_OFF_CFG2_1" acronym="RESOLVER_REGS_DC_OFF_CFG2_1" offset="532" width="32" description="DC Offset Config2.">
		<bitfield id="COS_MAN_OFF_ADJ" width="16" begin="31" end="16" resetval="0x0" description="Signed Cos manual dc offset" range="31:16" rwaccess="R/W"/>
	<bitfield id="SIN_MAN_OFF_ADJ" width="16" begin="15" end="0" resetval="0x0" description="Signed Sin manual dc offset" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DC_OFF1" acronym="RESOLVER_REGS_DC_OFF1" offset="536" width="32" description="DC Offset.">
		<bitfield id="COS_OFFSET" width="16" begin="31" end="16" resetval="0x0" description="Signed Cos auto dc offset" range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_OFFSET" width="16" begin="15" end="0" resetval="0x0" description="Signed Sin auto dc offset" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_SAMPLE_CFG1_1" acronym="RESOLVER_REGS_SAMPLE_CFG1_1" offset="540" width="32" description="Ideal Sample Config1.">
		<bitfield id="IDEAL_SAMPLE_TIME_OVR" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample count Overide" range="31:24" rwaccess="R/W"/>
	<bitfield id="IDEAL_SAMPLE_TIME" width="8" begin="23" end="16" resetval="0x0" description="Current Ideal sample count, round down" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAK_AVG_LIMIT" width="3" begin="15" end="13" resetval="0x0" description="2^n  peakaveragelimit is how many times to average the ideal peak point: 0 to 7" range="15:13" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_SAMPLE_CFG2_1" acronym="RESOLVER_REGS_SAMPLE_CFG2_1" offset="544" width="32" description="Ideal Sample Config2.">
		<bitfield id="SAMPLE_DET_THRESHOLD" width="16" begin="31" end="16" resetval="0x0" description="Abs value, the sig needs to be above to trigger the peak detect" range="31:16" rwaccess="R/W"/>
	<bitfield id="BANDPASSFILTERSAMPLEADJUST" width="5" begin="12" end="8" resetval="0x10" description="Offset compensate the ideal phase time selection if bpass filter enabled note when you are in manual mode, this value is not longer added " range="12:8" rwaccess="R/W"/>
	<bitfield id="PEAK_AVG_LIMIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="Ideal sample count training completed, Wrt 1 to Clr" range="0" rwaccess="R/W1TC"/>
	</register><register id="RESOLVER_REGS_DEC_GF_CFG1" acronym="RESOLVER_REGS_DEC_GF_CFG1" offset="548" width="32" description="Dec GF Config.">
		<bitfield id="IDEAL_SAMPLE_MODE" width="2" begin="26" end="25" resetval="0x0" description="Ideal sample time detection: 0 autodetect, 1 detect on sin channel 2 on cos channel 3 manual" range="26:25" rwaccess="R/W"/>
	<bitfield id="ENABLE_BOTTOM" width="1" begin="24" end="24" resetval="0x0" description="This enables bottom wave to get used in the avg" range="24" rwaccess="R/W"/>
	<bitfield id="NOISE_THRESHOLD" width="12" begin="11" end="0" resetval="0x0" description="Abs value, if above use the current moving avg, drop the new data" range="11:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG1_1" acronym="RESOLVER_REGS_PG_EST_CFG1_1" offset="552" width="32" description="Phase and Gain Est for correction block Config1.">
		<bitfield id="AGC_FILTER_COEF2" width="4" begin="31" end="28" resetval="0x0" description="NOT USED" range="31:28" rwaccess="R/W"/>
	<bitfield id="AGC_FILTER_COEF1" width="4" begin="27" end="24" resetval="0x0" description="NOT USED" range="27:24" rwaccess="R/W"/>
	<bitfield id="AUTOPHASEGAINREADYDONE" width="1" begin="16" end="16" resetval="0x0" description="Status of Auto Gain and Phase Est , set when ready for each cycle , wrt 1 to clear, this has no effect to the correction logic " range="16" rwaccess="R/W1TC"/>
	<bitfield id="PHASEFILTCOEFF" width="4" begin="7" end="4" resetval="0x0" description="NOT USED" range="7:4" rwaccess="R/W"/>
	<bitfield id="PG_TRAIN_LIMIT" width="4" begin="3" end="0" resetval="0x0" description="^n pg_train_limit : 0 to 15" range="3:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG2_1" acronym="RESOLVER_REGS_PG_EST_CFG2_1" offset="556" width="32" description="Phase and Gain Est for correction block Config2.">
		<bitfield id="PHASECOSBYP1" width="16" begin="31" end="16" resetval="0x0" description="Manual  Phase Cos correction value" range="31:16" rwaccess="R/W"/>
	<bitfield id="BYPASSPHASEGAINCORR1" width="1" begin="3" end="3" resetval="0x0" description="Enables phase and gain est " range="3" rwaccess="R/W"/>
	<bitfield id="AUTOPHASECONTROL1" width="1" begin="2" end="2" resetval="0x0" description="Enable  Auto Phase correction" range="2" rwaccess="R/W"/>
	<bitfield id="AUTOGAINCONTROL1" width="1" begin="1" end="1" resetval="0x0" description="Enable Auto Gain correction" range="1" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG3_1" acronym="RESOLVER_REGS_PG_EST_CFG3_1" offset="560" width="32" description="Phase and Gain Est for correction block Config3.">
		<bitfield id="GAINCOSBYP1" width="16" begin="31" end="16" resetval="0x0" description="Manual Gain Cos correction value" range="31:16" rwaccess="R/W"/>
	<bitfield id="GAINSINBYP1" width="16" begin="15" end="0" resetval="0x0" description="Manual Gain Sin correction value, always pos" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG4_1" acronym="RESOLVER_REGS_PG_EST_CFG4_1" offset="564" width="32" description="Phase and Gain Est for correction block Config4.">
		<bitfield id="PHASEESTIMATEFINAL" width="16" begin="31" end="16" resetval="0x0" description="Cos Auto Cal Phase correction value cal by est " range="31:16" rwaccess="RO"/>
	<bitfield id="PG_GLITCHTHRESHOLD" width="16" begin="15" end="0" resetval="0x16384" description="glitch threshold to estimate new rotation start in degrees" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG5_1" acronym="RESOLVER_REGS_PG_EST_CFG5_1" offset="568" width="32" description="Phase and Gain Est for correction block Config5.">
		<bitfield id="COSSQACCFINAL1" width="32" begin="31" end="0" resetval="0x0" description="Cos Auto Cal Gain correction value cal by est " range="31:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_PG_EST_CFG6_1" acronym="RESOLVER_REGS_PG_EST_CFG6_1" offset="572" width="32" description="Phase and Gain Est for correction block Config6.">
		<bitfield id="SINSQACCFINAL1" width="32" begin="31" end="0" resetval="0x0" description="Sin Auto Cal Gain correction value cal by est " range="31:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_TRACK2_CFG1_1" acronym="RESOLVER_REGS_TRACK2_CFG1_1" offset="576" width="32" description="Track2 Kp, Ki, Kd, Kvelfilt, Kffw, Boost Cfg1 .">
		<bitfield id="KVELFILT" width="8" begin="31" end="24" resetval="0x5" description="Kvelfilt" range="31:24" rwaccess="R/W"/>
	<bitfield id="KD" width="8" begin="23" end="16" resetval="0x0" description="NOT USED" range="23:16" rwaccess="R/W"/>
	<bitfield id="KI" width="8" begin="15" end="8" resetval="0x60" description="Ki" range="15:8" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_TRACK2_CFG2_1" acronym="RESOLVER_REGS_TRACK2_CFG2_1" offset="580" width="32" description="Track2 Feed Fwd Boost Kffw Cfg2.">
		<bitfield id="KFFW" width="8" begin="11" end="4" resetval="0x6" description="Kffw" range="11:4" rwaccess="R/W"/>
	<bitfield id="EARLYESTIMATE" width="1" begin="2" end="2" resetval="0x0" description="NOT USED" range="2" rwaccess="R/W"/>
	<bitfield id="BOOST" width="1" begin="1" end="1" resetval="0x1" description="Boost Enable" range="1" rwaccess="R/W"/>
	<bitfield id="FEED_FWD_CORR" width="1" begin="0" end="0" resetval="0x0" description="NOT USED" range="0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_TRACK2_CFG3_1" acronym="RESOLVER_REGS_TRACK2_CFG3_1" offset="584" width="32" description="Track2 Cfg3.">
		<bitfield id="BOOSTVEL" width="1" begin="24" end="24" resetval="0x0" description="0 disables and 1 enables  accel/decel compensation for velocity calculation. boost also needs to be 1	" range="24" rwaccess="R/W"/>
	<bitfield id="KPDIV" width="8" begin="15" end="8" resetval="0x0" description="Kp proportional path gain" range="15:8" rwaccess="R/W"/>
	<bitfield id="VBOOSTCOEFF" width="8" begin="7" end="0" resetval="0x0" description="unsigned velocity accel/decel comp coefficient" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_ANGLE_ARCTAN_1" acronym="RESOLVER_REGS_ANGLE_ARCTAN_1" offset="588" width="32" description="Angle and Velocity from acrtan .">
		<bitfield id="ANGLE" width="16" begin="15" end="0" resetval="0x0" description="Signed(2s complement) Angle from arctan -180  to 0  to +180 scaled" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_ANGLE_TRACK2_1" acronym="RESOLVER_REGS_ANGLE_TRACK2_1" offset="592" width="32" description="Angle and Velocity from track2.">
		<bitfield id="ANGLE" width="16" begin="15" end="0" resetval="0x0" description="Signed(2s complement) Angle from track2 -180  to 0  to +180 scaled" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_VELOCITY_TRACK2_1" acronym="RESOLVER_REGS_VELOCITY_TRACK2_1" offset="596" width="32" description="Angle and Velocity from track2.">
		<bitfield id="VELOCITY" width="32" begin="31" end="0" resetval="0x0" description="This register gives rotation frequency as a function of exc freq and double/single sample mode. Formula on matlab comment. (rotation frequency in Hz, signed based on direction) =  (velocity) * (1/Ts) * 1/2^32  Note: if it's top/bottom sampling, Ts = Texc/2, otherwise Ts=Texc" range="31:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OFFSET_1" acronym="RESOLVER_REGS_OFFSET_1" offset="600" width="32" description="SIN and COS Offset.">
		</register><register id="RESOLVER_REGS_DIAG1_1" acronym="RESOLVER_REGS_DIAG1_1" offset="616" width="32" description="Diag1 1">
		<bitfield id="OFFSETDRIFT_THRESHOLD_LO" width="16" begin="31" end="16" resetval="0x0" description="Signed Lo threshold to detect offset drift" range="31:16" rwaccess="R/W"/>
	<bitfield id="OFFSETDRIFT_THRESHOLD_HI" width="16" begin="15" end="0" resetval="0x0" description="Signed Hi threshold to detect offsetdrift" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG2_1" acronym="RESOLVER_REGS_DIAG2_1" offset="620" width="32" description="Diag2 1">
		<bitfield id="EXCFREQDETECTED_COS" width="16" begin="31" end="16" resetval="0x0" description="SW OBS Counts detected between zcs for cos excitation frequency" range="31:16" rwaccess="RO"/>
	<bitfield id="EXCFREQDETECTED_SIN" width="16" begin="15" end="0" resetval="0x0" description="SW OBS Counts detected between zcs for sin excitation frequency" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG3_1" acronym="RESOLVER_REGS_DIAG3_1" offset="624" width="32" description="Diag3 1">
		<bitfield id="EXCFREQDRIFT_THRESHOLD_LO" width="16" begin="31" end="16" resetval="0x0" description="Lo threshold to detect excfreqdrift" range="31:16" rwaccess="R/W"/>
	<bitfield id="EXCFREQDRIFT_THRESHOLD_HI" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect excfreqdrift" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG4_1" acronym="RESOLVER_REGS_DIAG4_1" offset="628" width="32" description="Diag4 1">
		<bitfield id="EXCFREQDRIFT_GLITCHCOUNT" width="8" begin="23" end="16" resetval="0x1" description="Counter limit, how many times before issuing error" range="23:16" rwaccess="R/W"/>
	<bitfield id="EXCFREQ_LEVEL" width="16" begin="15" end="0" resetval="0x0" description="Threshold on ADC value to detect sin or cos zero crossings" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG5_1" acronym="RESOLVER_REGS_DIAG5_1" offset="632" width="32" description="Diag5 1">
		<bitfield id="LOWAMPLITUDE_GLITCHCOUNT" width="8" begin="23" end="16" resetval="0x1" description="Counter limit, how many times before issuing error" range="23:16" rwaccess="R/W"/>
	<bitfield id="LOWAMPLITUDE_THRESHOLD" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect lowamplitude. Both sin and cos need to be lower than this at the same time" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG6_1" acronym="RESOLVER_REGS_DIAG6_1" offset="636" width="32" description="Diag6 1">
		<bitfield id="LOWAMPLITUDE_COS" width="16" begin="31" end="16" resetval="0x0" description="Value of cos channel at the error trigger instant" range="31:16" rwaccess="RO"/>
	<bitfield id="LOWAMPLITUDE_SIN" width="16" begin="15" end="0" resetval="0x0" description="Value of sin channel at the error trigger instant" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG7_1" acronym="RESOLVER_REGS_DIAG7_1" offset="640" width="32" description="Diag7 1">
		<bitfield id="HIGHAMPLITUDE_GLITCHCOUNT" width="8" begin="23" end="16" resetval="0x1" description="Counter limit, how many times before issuing error" range="23:16" rwaccess="R/W"/>
	<bitfield id="HIGHAMPLITUDE_THRESHOLD" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect highamplitude. Both sin and cos need to be higher than this at the same time" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG8_1" acronym="RESOLVER_REGS_DIAG8_1" offset="644" width="32" description="Diag8 1">
		<bitfield id="HIGHAMPLITUDE_COS" width="16" begin="31" end="16" resetval="0x0" description="Value of cos channel at the error trigger instant" range="31:16" rwaccess="RO"/>
	<bitfield id="HIGHAMPLITUDE_SIN" width="16" begin="15" end="0" resetval="0x0" description="Value of sin channel at the error trigger instant" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG9_1" acronym="RESOLVER_REGS_DIAG9_1" offset="648" width="32" description="Diag9 1">
		<bitfield id="SINSQCOSSQ_THRESHOLD_HI" width="16" begin="31" end="16" resetval="0x0" description="High threshold to detect sinsqcossq. Sin^2+Cos^2 s needs to be lower than this" range="31:16" rwaccess="R/W"/>
	<bitfield id="SINSQCOSSQ_THRESHOLD_LO" width="16" begin="15" end="0" resetval="0x0" description="Low threshold to detect sinsqcossq. Sin^2+Cos^2 s needs to be lower than this" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG10_1" acronym="RESOLVER_REGS_DIAG10_1" offset="652" width="32" description="Diag10 1">
		<bitfield id="SINSQCOSSQ_COSSQ" width="16" begin="31" end="16" resetval="0x0" description="Actual cossq value on error trigger ether lo or hi triggered, first event" range="31:16" rwaccess="RO"/>
	<bitfield id="SINSQCOSSQ_SINSQ" width="16" begin="15" end="0" resetval="0x0" description="Actual sinsq value on error trigger ether lo or hi triggered, first event" range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG11_1" acronym="RESOLVER_REGS_DIAG11_1" offset="656" width="32" description="Diag11 1">
		<bitfield id="SINSQCOSSQ_GLITCHCOUNT" width="8" begin="7" end="0" resetval="0x1" description="Counter limit, how many times before issuing error" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG12_1" acronym="RESOLVER_REGS_DIAG12_1" offset="660" width="32" description="Diag12 1">
		<bitfield id="ROTPEAK_LEVEL" width="16" begin="31" end="16" resetval="0x0" description="Peak level of rotational sin/cos when other signal is zero crossing" range="31:16" rwaccess="R/W"/>
	<bitfield id="ROTFREQ_LEVEL" width="16" begin="15" end="0" resetval="0x0" description="Zero crossing detection level of rotational sin/cos" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG13_1" acronym="RESOLVER_REGS_DIAG13_1" offset="664" width="32" description="Diag13 1">
		<bitfield id="COS_MULTI_ZC_ERROR_COUNT" width="8" begin="31" end="24" resetval="0x0" description="Status of cos	Capture number of faulty zcs" range="31:24" rwaccess="RO"/>
	<bitfield id="SIN_MULTI_ZC_ERROR_COUNT" width="8" begin="23" end="16" resetval="0x0" description="Status of sin	Capture number of faulty zcs" range="23:16" rwaccess="RO"/>
	<bitfield id="COS_NEG_ZC_PEAK_MISMATCH_ERR" width="1" begin="3" end="3" resetval="0x0" description="During negative cos zero-crossing cos is not + or - peak" range="3" rwaccess="RO"/>
	<bitfield id="COS_POS_ZC_PEAK_MISMATCH_ERR" width="1" begin="2" end="2" resetval="0x0" description="During positive cos zero-croscosg cos is not + or - peak" range="2" rwaccess="RO"/>
	<bitfield id="SIN_NEG_ZC_PEAK_MISMATCH_ERR" width="1" begin="1" end="1" resetval="0x0" description="During negative sin zero-crossing cos is not + or - peak" range="1" rwaccess="RO"/>
	<bitfield id="SIN_POS_ZC_PEAK_MISMATCH_ERR" width="1" begin="0" end="0" resetval="0x0" description="During positive sin zero-crossing cos is not + or - peak" range="0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_DIAG14_1" acronym="RESOLVER_REGS_DIAG14_1" offset="668" width="32" description="Diag14 1">
		<bitfield id="GAINDRIFT_THRESHOLD_LO" width="16" begin="31" end="16" resetval="0x0" description="Lo threshold to detect cos_gain drift" range="31:16" rwaccess="R/W"/>
	<bitfield id="GAINDRIFT_THRESHOLD_HI" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect cos_gain drift" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG15_1" acronym="RESOLVER_REGS_DIAG15_1" offset="672" width="32" description="Diag15 1">
		<bitfield id="GAINDRIFT_GLITCHCOUNT" width="8" begin="7" end="0" resetval="0x1" description="Counter limit, how many times before issuing error" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG16_1" acronym="RESOLVER_REGS_DIAG16_1" offset="676" width="32" description="Diag16 1">
		<bitfield id="PHASEDRIFT_THRESHOLD_LO" width="16" begin="31" end="16" resetval="0x0" description="Lo threshold to detect cos phase drift" range="31:16" rwaccess="R/W"/>
	<bitfield id="PHASEDRIFT_THRESHOLD_HI" width="16" begin="15" end="0" resetval="0x0" description="Hi threshold to detect cos phase drift" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG17_1" acronym="RESOLVER_REGS_DIAG17_1" offset="680" width="32" description="Diag17 1">
		<bitfield id="PHASEDRIFT_GLITCHCOUNT" width="8" begin="7" end="0" resetval="0x1" description="Counter limit, how many times before issuing error" range="7:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_DIAG18_1" acronym="RESOLVER_REGS_DIAG18_1" offset="684" width="32" description="Diag18 1">
		<bitfield id="TRACK_ERR_GLITCH_TIME" width="8" begin="23" end="16" resetval="0x1" description="NOT USED " range="23:16" rwaccess="R/W"/>
	<bitfield id="TRACK_ERR_THRESHOLD" width="16" begin="15" end="0" resetval="0x0" description="Tracking error treshold" range="15:0" rwaccess="R/W"/>
	</register><register id="RESOLVER_REGS_OBS_ADC_1" acronym="RESOLVER_REGS_OBS_ADC_1" offset="700" width="32" description="Sw Obs adc data post latch and avg if enabled   ">
		<bitfield id="COS_ADC" width="16" begin="31" end="16" resetval="0x0" description="Signed SW Obs adc data post latch and avg if enabled " range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_ADC" width="16" begin="15" end="0" resetval="0x0" description="Signed SW Obs adc data post latch and avg if enabled " range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_ADC_REC_1" acronym="RESOLVER_REGS_OBS_ADC_REC_1" offset="704" width="32" description="Sw Obs adc data post recovered data, so post dec  ">
		<bitfield id="COS_REC" width="16" begin="31" end="16" resetval="0x0" description="Signed SW Ob sadc data post recovered data, so post dec " range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_REC" width="16" begin="15" end="0" resetval="0x0" description="Signed SW Obs adc data post recovered data, so post dec " range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_ADC_DC_1" acronym="RESOLVER_REGS_OBS_ADC_DC_1" offset="708" width="32" description="Sw Obs adc data post dc offset.">
		<bitfield id="COS_DC" width="16" begin="31" end="16" resetval="0x0" description="Signed SW Obs adc data post dc offset  " range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_DC" width="16" begin="15" end="0" resetval="0x0" description="Signed SW Obs adc data post dc offset   " range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_ADC_PGC_1" acronym="RESOLVER_REGS_OBS_ADC_PGC_1" offset="712" width="32" description="Sw Obs post phase and gain correction .">
		<bitfield id="COS_PGC" width="16" begin="31" end="16" resetval="0x0" description="Signed SW Obs adc data post phase and gain correction " range="31:16" rwaccess="RO"/>
	<bitfield id="SIN_PGC" width="16" begin="15" end="0" resetval="0x0" description="Signed SW Obs adc data post phase and gain correction " range="15:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM3_0_1" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM3_0_1" offset="720" width="32" description="SW obs peak histogram buckets.">
		<bitfield id="PEAKHISTOGRAM3_1" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket3" range="31:24" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM2_1" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket2" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM1_1" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket1" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM0_1" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket0" range="7:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM7_4_1" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM7_4_1" offset="724" width="32" description="SW obs peak histogram buckets .">
		<bitfield id="PEAKHISTOGRAM7_1" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket7" range="31:24" rwaccess="RO"/>
