ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/RESOLVER_RESOLVER_REGS_502CB000h.xml
	<bitfield id="PEAKHISTOGRAM6_1" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket6" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM5_1" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket5" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM4_1" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket4" range="7:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM11_8_1" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM11_8_1" offset="728" width="32" description="SW obs peak histogram buckets .">
		<bitfield id="PEAKHISTOGRAM11_1" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket11" range="31:24" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM10_1" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket10" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM9_1" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket9" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM8_1" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket8" range="7:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM15_12_1" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM15_12_1" offset="732" width="32" description="SW obs peak histogram buckets .">
		<bitfield id="PEAKHISTOGRAM15_1" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket15" range="31:24" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM14_1" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket14" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM13_1" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket13" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM12_1" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket12" range="7:0" rwaccess="RO"/>
	</register><register id="RESOLVER_REGS_OBS_PEAKHISTOGRAM19_16_1" acronym="RESOLVER_REGS_OBS_PEAKHISTOGRAM19_16_1" offset="736" width="32" description="SW obs peak histogram buckets .">
		<bitfield id="PEAKHISTOGRAM19_1" width="8" begin="31" end="24" resetval="0x0" description="Ideal sample bucket19" range="31:24" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM18_1" width="8" begin="23" end="16" resetval="0x0" description="Ideal sample bucket18" range="23:16" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM17_1" width="8" begin="15" end="8" resetval="0x0" description="Ideal sample bucket17" range="15:8" rwaccess="RO"/>
	<bitfield id="PEAKHISTOGRAM16_1" width="8" begin="7" end="0" resetval="0x0" description="Ideal sample bucket16" range="7:0" rwaccess="RO"/>
	</register>
</module>